Repository: doubleden/RustQuiz
Catalog: RustQuiz/Localization/Localizable.xcstrings
Source language: en
Languages: ru

source: Generics are declared after the function name in <T>
ru: Generics объявляются после имени функции in <T>

source: Generics are turned into concrete types at compile-time
ru: Дженерики превращаются в конкретные типы во время компиляции

source: Generics are written in angle brackets <T>
ru: Generics записываются in угловых скобках <T>

source: Generics only
ru: Только дженерики

# generics_traits_lifetimes_link
source: https://doc.rust-lang.org/book/ch10-00-generics.html
ru: https://doc.rust-lang.ru/book/ch10-00-generics.html

source: get is safe and always returns Option<&T>
ru: получение безопасно и всегда возвращается Option<&T>

source: Give access to static
ru: Предоставьте доступ к static

source: Gives context on failure
ru: Дает представление о неудачах

source: Gives field names width and height
ru: Дает полям имена ширины и высоты

source: glob can obscure which items are in scope
ru: glob может скрыть, какие элементы находятся в области видимости in

source: Global variable
ru: Глобальная переменная

source: Grapheme clusters
ru: Графемные кластеры

source: Graphemes
ru: Графемы

source: Graphemes require external crates
ru: Графемы требуют внешних ящиков

source: Guarantees no dangling references
ru: Гарантирует отсутствие висячих ссылок

source: Guarantees no panics
ru: Гарантирует отсутствие паники

source: Handle concurrent operations
ru: Выполнение параллельных операций

source: Handle errors in a centralized way
ru: Централизованная обработка ошибок in

source: Handles errors only
ru: Обрабатывает только ошибки

source: Handles multiple formats
ru: Работает с несколькими форматами

source: Handles Ok
ru: Ручки Ok

source: Has a resource and Drop - copying would be unsafe
ru: Имеет ресурс и Drop - копирование было бы unsafe

source: Has no parameters
ru: Не имеет параметров

source: Has runtime overhead and prevents some optimizations
ru: Имеет накладные расходы во время выполнения и препятствует некоторым оптимизациям

source: HashMap lives in the collections module
ru: HashMap жизни in модуль коллекций

source: HashMap::new() is the standard way
ru: HashMap::new() - это стандартный способ

source: HashMap<String, Box<Command>>
ru: HashMap&lt;String, Box<Command>&gt

source: Having a shared iterator reference while taking a mutable reference violates Rust's aliasing rules
ru: Наличие общей ссылки на итератор while, принимающей мутабельную ссылку, нарушает правила Rust о псевдонимии

source: Heap data
ru: Данные из кучи

source: Help the borrow checker understand relationships between references
ru: Помогите проверяющему понять взаимосвязь между ссылками

source: Helper functions that take structs as parameters eliminate repetitive setup code in examples
ru: Функции-помощники, принимающие параметры structs as, устраняют повторяющийся код настройки in примеры

source: Helps verify that panic occurred for the right reason
ru: Помогает убедиться, что паника возникла for по правильной причине

source: Hex literal:
ru: Шестнадцатеричный литерал:

source: Hides the error
ru: Скрывает ошибку

source: Hides the stack
ru: Скрывает стек

source: Hiding implementation details of an object
ru: Скрытие деталей реализации объекта

source: How are lifetime parameters denoted?
ru: Как обозначаются параметры времени жизни?

source: How are raw pointers created?
ru: Как создаются необработанные указатели?

source: How are tests run by default in Rust?
ru: Как выполняются тесты по умолчанию in Rust?

source: How are variables declared by default in Rust?
ru: Как переменные объявляются по умолчанию in Rust?

source: How can code be reused in Rust instead of inheritance?
ru: Как можно повторно использовать код in Rust вместо наследования?

source: How can you add an Option to the end of an iterator?
ru: Как можно добавить Option в конец итератора?

source: How can you deny warnings without modifying code?
ru: Как запретить предупреждения, не изменяя код?

source: How do Color and Point differ?
ru: Чем отличаются do Color и Point?

source: How do error kinds differ in Rust?
ru: Чем do виды ошибок отличаются in Rust?

source: How do for loops and iterators differ?
ru: Чем отличаются циклы do for и итераторы?

source: How do iter, into_iter, iter_mut methods differ for a vector?
ru: Чем отличаются методы do iter, into_iter, iter_mut for вектора?

source: How do macros differ from functions?
ru: Чем do макросы отличаются от функций?

source: How do Message::Quit and Message::Write(String) differ?
ru: Чем отличаются do Сообщение::Quit и Сообщение::Write(String)?

source: How do parallelism and concurrency differ?
ru: Чем отличаются do параллелизм и параллелизм?

source: How do request_review and approve methods in type-oriented version work with self?
ru: Как методы do request_review и approve in type -ориентированной версии работают с self?

source: How do Rust's generic types differ from C++ templates?
ru: Чем do родовые типы Rust отличаются от шаблонов C++?

source: How do static variables differ from constants?
ru: Чем do static переменные отличаются от констант?

source: How do struct and enum differ with pub?
ru: Чем do struct и enum отличаются от pub?

source: How do you access a struct field?
ru: Как do получить доступ к полю struct?

source: How do you add the external crate rand?
ru: Как do вы добавляете внешний crate ранд?

source: How do you call a method?
ru: Как do вызвать метод?

source: How do you call an associated function?
ru: Как do вызвать ассоциированную функцию?

source: How do you check if an iterator has an element satisfying a condition?
ru: Как do проверить, что if в итераторе есть элемент, удовлетворяющий условию?

source: How do you combine multiple trait bounds?
ru: Как do объединить несколько trait границ?

source: How do you constrain a generic type in Rust?
ru: Как do сдерживать общий type in Rust?

source: How do you create a new project with a binary crate?
ru: Как do создать новый проект с бинарным crate?

source: How do you create a new project with a library crate?
ru: Как do создать новый проект с библиотекой crate?

source: How do you create a struct instance?
ru: Как do создать экземпляр struct?

source: How do you create a trait object?
ru: Как do создать объект trait?

source: How do you create an empty i32 vector?
ru: Как do создать пустой вектор i32?

source: How do you create an enum instance?
ru: Как do создать экземпляр enum?

source: How do you create multiple binary crates in one package?
ru: Как do создать несколько бинарных кристаллов in одном пакете?

source: How do you declare a closure without parameters?
ru: Как do объявить закрытие без параметров?

source: How do you declare a method for a struct?
ru: Как do объявить метод for на struct?

source: How do you declare a method that changes fields?
ru: Как do объявить метод, изменяющий поля?

source: How do you declare a trait?
ru: Как do вы объявляете trait?

source: How do you declare a tuple struct?
ru: Как do объявить кортеж struct?

source: How do you declare an enum IpAddrKind with variants V4 and V6?
ru: Как do объявить enum IpAddrKind с вариантами V4 и V6?

source: How do you define a default method in a trait?
ru: Как do определить метод по умолчанию in a trait?

source: How do you fix a struct with &str?
ru: Как do исправить struct с помощью &amp;str?

source: How do you get a value out of an Option?
ru: Как do получить значение из Option?

source: How do you implement a trait for a struct?
ru: Как do реализовать trait for struct ?

source: How do you limit the number of threads for tests?
ru: Как do ограничить количество потоков for тестов?

source: How do you make a variable immutable after initial mutation?
ru: Как do сделать переменную неизменяемой после начальной мутации?

source: How do you move just some variables into a closure while borrowing others?
ru: Как do вы move только одни переменные в закрытие while, заимствуя другие?

source: How do you properly move submodule hosting to a separate file?
ru: Как do правильно move хостинг подмодулей в отдельный файл?

source: How do you return a type that implements a trait?
ru: Как do вы return type , который реализует trait?

source: How do you run only a test named foo_test?
ru: Как do запустить только test с именем foo_test?

source: How do you run only ignored tests?
ru: Как do выполнить только игнорируемые тесты?

source: How do you safely convert a C string pointer to &str in FFI?
ru: Как do безопасно преобразовать строковый указатель языка C в &amp;str in FFI?

source: How do you use a trait as a function parameter?
ru: Как do вы use trait as параметр функции?

source: How does &str differ from String?
ru: Чем &amp;str отличается от String?

source: How does a closure capture variables by default?
ru: Как закрытие по умолчанию захватывает переменные?

source: How does a closure differ from a regular function?
ru: Чем закрытие отличается от обычной функции?

source: How does a function differ from a method?
ru: Чем функция отличается от метода?

source: How does a workspace differ from a package?
ru: Чем рабочее пространство отличается от пакета?

source: How does all differ from any?
ru: Чем все отличается от любого?

source: How does Arc<T> differ from Rc<T>?
ru: Чем Arc<T> отличается от Rc<T>?

source: How does assert_eq! differ from assert!?
ru: Чем assert_eq! отличается от assert!?

source: How does Composition over Inheritance improve flexibility?
ru: Как композиция по сравнению с наследованием повышает гибкость?

source: How does const differ from let?
ru: Чем const отличается от let?

source: How does data binding work in match?
ru: Как работает привязка данных in match ?

source: How does dbg! differ from println!?
ru: Чем отличается dbg! от println!?

source: How does Encapsulation improve security?
ru: Как инкапсуляция повышает безопасность?

source: How does expect() differ from unwrap()?
ru: Чем отличается функция expect() от функции unwrap()?

source: How does filter work?
ru: Как работает фильтр?

source: How does function syntax differ from closure syntax?
ru: Чем синтаксис функций отличается от синтаксиса закрытия?

source: How does let…else differ from if let?
ru: Чем let...else отличается от if let ?

source: How does match differ from if?
ru: Чем match отличается от if?

source: How does match on Result compare to ?
ru: Как match на Result по сравнению с ?

source: How does Rc<T> differ from Box<T>?
ru: Чем Rc<T> отличается от Box<T>?

source: How does recv in an async channel differ from a sync channel?
ru: Чем отличается канал recv in async от канала синхронизации?

source: How does recv() differ from try_recv() on Receiver?
ru: Чем отличается функция recv() от try_recv() в Receiver?

source: How does Rust implement polymorphism?
ru: Как в Rust реализован полиморфизм?

source: How does Rust replace -> from C++?
ru: Как Rust заменяет -&gt; из C++?

source: How does the filter closure receive elements?
ru: Каким образом в фильтрующий затвор поступают элементы?

source: How does the Fold pattern relate to the Visitor pattern?
ru: Как модель Fold связана с моделью Visitor?

source: How does the message-passing approach slogan sound?
ru: Как звучит лозунг подхода, основанного на передаче сообщений?

source: How does trpl::sleep differ from thread::sleep?
ru: Чем отличается trpl::sleep от thread::sleep?

source: How does use differ from pub use?
ru: Чем use отличается от pub use ?

source: How is a struct defined in Rust?
ru: Как определяется struct in Rust?

source: How is a type parameter denoted in Rust?
ru: Как обозначается параметр type in Rust?

source: How is a Visitor typically created in Serde?
ru: Как обычно создается посетитель in Serde?

source: How is encapsulation controlled in Rust?
ru: Как контролируется инкапсуляция in Rust?

source: How is the standard library included?
ru: Как включена стандартная библиотека?

source: How is the update syntax written?
ru: Как написан синтаксис обновления?

source: How many "superpowers" does unsafe give?
ru: Сколько "сверхспособностей" дает сайт unsafe?

source: How many levels of indirection does &String have?
ru: Сколько уровней непрямой связи имеет сайтString?

source: How many library crates can a package have?
ru: Сколько библиотечных ящиков может быть в пакете?

source: How many types of procedural macros exist?
ru: Сколько типов процедурных макросов существует?

source: How should flat enums be exposed in FFI?
ru: Как должны быть представлены плоские перечисления in FFI?

source: How should structured enums with data be exposed in FFI?
ru: Как должны быть представлены структурированные перечисления с данными in FFI?

source: How to "bake in" value validation into types?
ru: Как "запечь in" проверку значений в типы?

source: How to allow modifying a borrowed String?
ru: Как разрешить модификацию заимствованного String?

source: How to avoid reference cycle in parent↔children tree?
ru: Как избежать цикла ссылок in в дереве родитель-↔-дети?

source: How to break cycle in Rc-graph?
ru: Как break цикл in Rc-график?

source: How to call an unsafe function?
ru: Как вызвать функцию unsafe?

source: How to check if object pointed to by Weak<T> is alive?
ru: Как проверить, что объект if, на который указывает Weak<T>, жив?

source: How to correctly organize a "counter" from 10 threads, each incrementing shared counter?
ru: Как правильно организовать "счетчик" из 10 потоков, каждый из которых инкрементирует общий счетчик?

source: How to create a HashMap?
ru: Как создать HashMap?

source: How to create a String from a literal?
ru: Как создать String из литерала?

source: How to create an empty string?
ru: Как создать пустую строку?

source: How to declare unsafe trait?
ru: Как объявить unsafe trait ?

source: How to exit an infinite loop properly?
ru: Как правильно выйти из бесконечного loop?

source: How to fix dangle?
ru: Как закрепить болтающийся элемент?

source: How to fix using a refutable pattern in let?
ru: Как исправить использование опровержимого шаблона in let ?

source: How to get a slice of the first 4 bytes of a string?
ru: Как получить фрагмент первых 4 байт строки?

source: How to get a value from a HashMap?
ru: Как получить значение из HashMap?

source: How to get Rc<T> from Weak<T>?
ru: Как получить Rc<T> от слабого<T>?

source: How to get result from thread launched with spawn?
ru: Как получить результат из потока, запущенного с помощью spawn?

source: How to implement unsafe trait?
ru: Как реализовать unsafe trait ?

source: How to import two items from std correctly?
ru: Как правильно импортировать два товара с сайта std?

source: How to iterate immutably over a vector?
ru: Как сделать итерацию по вектору непрерывной?

source: How to modify all elements in a vector?
ru: Как изменить все элементы in вектора?

source: How to organize "many owners + mutation" in multithreaded code?
ru: Как организовать "множество владельцев + мутация" in многопоточного кода?

source: How to react differently to io::Error kinds?
ru: Как по-другому реагировать на виды ошибок io::Error?

source: How to resolve the Result name conflict?
ru: Как разрешить Result конфликт имен?

source: How to return a value without return?
ru: Как получить значение return без return?

source: How to return closure from function?
ru: Как сделать return закрытие из функции?

source: How to specify supertrait?
ru: Как задать супертрейт?

source: How to switch panics to immediate abort?
ru: Как переключить панику на немедленное прерывание?

source: How to work with DST?
ru: Как работать с DST?

source: Idiomatic is to import the full path to the type
ru: Идиоматический вариант - импортировать полный путь к type

source: Idiomatic iteration
ru: Идиоматическая итерация

source: Idiomatic Rust imports the module, then calls module::func()
ru: Идиоматический Rust импортирует модуль, а затем вызывает модуль::func()

source: Idiomatic Rust style
ru: Идиоматический стиль Rust

source: Idioms
ru: Идиомы

source: If a destructor panics while unwinding, Rust has no good option and aborts immediately
ru: Если деструктор паникует while, у Rust нет хорошего варианта, и он немедленно прерывается

source: If a parameter and a field share a name, you can write it once. Reduces duplication
ru: Если параметр и поле имеют общее имя, его можно записать один раз. Сокращает дублирование

source: If an enum is public, all its variants are public
ru: Если enum является общедоступным, то все его варианты являются общедоступными

source: if can store data, match can't
ru: if может хранить данные, match - нет

source: if checks a bool; match works with any value
ru: if проверяет bool; match работает с любым значением

source: if error == NotFound
ru: if ошибка == NotFound

source: if is an expression; else is optional
ru: if выражение; else необязательно

source: if let doesn't require handling all variants. Exhaustiveness only with match
ru: if let не требует обработки всех вариантов. Исчерпание только при match

source: if let extracts the value from Some. A condensed form of match
ru: if let извлекает ценность из Some. Сокращенная форма match

source: if let is handy when you care about one case. Less boilerplate
ru: if let удобен, когда вам важен один случай. Меньше шаблонов

source: if requires all branches; match doesn't
ru: if требует всех ветвей; match не требует

source: If strong references are exactly 1
ru: Если сильных ссылок ровно 1

source: If there's &self, the returned reference gets its lifetime
ru: Если есть &amp;self, возвращенная ссылка получает свое время жизни

source: If variable names match fields, you can write Point { x, y } instead of Point { x: x, y: y }
ru: Если имена переменных match полей, то вместо Point { x: x, y } можно написать Point { x: x, y: y }

source: If weak references are 0
ru: Если слабые ссылки равны 0

source: If you have any questions about this Privacy Policy, please contact us at: [denis.denisv8701@gmail.com]
ru: Если у вас есть какие-либо вопросы по настоящей Политике конфиденциальности, свяжитесь с нами по адресу: [denis.denisv8701@gmail.com]

source: If you put ; after x + 1 in function with -> i32:
ru: Если поставить ; после x + 1 in функция с -&gt; i32:

source: if-expression must have a single type
ru: if-выражение должно иметь единственный type

source: Ignore it
ru: Не обращайте внимания

source: Ignore the items
ru: Не обращайте внимания на предметы

source: Ignored
ru: Не найдено

source: Ignored by compiler
ru: Игнорируется компилятором

source: Ignores None
ru: Игнорирует None

source: Ignores remaining parts of value
ru: Игнорирует оставшиеся части стоимости

source: Immutable
ru: Неизменное

source: Immutable reference; read without owning
ru: Неизменная ссылка; читать без владения

source: Immutable transformations make code easier to understand and less prone to bugs
ru: Неизменяемые преобразования делают код более понятным и менее подверженным ошибкам

source: Imperative describes how, declarative describes what
ru: Императив описывает, как, декларатив - что

source: Imperative focuses on step-by-step instructions while declarative focuses on the end result
ru: Императив фокусируется на пошаговых инструкциях while Декларатив фокусируется на конечном результате

source: Imperative is faster than declarative
ru: Императив быстрее декларативного

source: Imperative is more type-safe
ru: Императив является более type- безопасным

source: impl Future<Output = T>
ru: impl Будущее<Output = T>

source: impl Rectangle { fn area(&self) { … } }
ru: impl Прямоугольник { fn area(&amp;self) { ... } }

source: impl Struct: Trait { … }
ru: impl Структура: Trait { ... }

source: impl Summary { … }
ru: impl Резюме { ... }

source: impl Trait in return position
ru: impl Черта in return позиция

source: impl Trait is syntactic sugar for trait bound
ru: impl Черта является синтаксическим сахаром for trait bound

source: impl Trait is the short syntax
ru: impl Trait - это краткий синтаксис

source: impl Trait works faster
ru: impl Черта работает быстрее

source: Implement Display
ru: Внедрить дисплей

source: Implementation in the trait serves as the default
ru: Реализация in trait обслуживает as по умолчанию

source: Implementation of custom pointer types
ru: Реализация пользовательских типов указателей

source: Implementing a trait for all types with a constraint
ru: Реализация trait for всех типов с ограничением

source: Implementing Deref for performance
ru: Реализация производительности Deref for

source: Implementing traits without storing data
ru: Реализация признаков без хранения данных

source: Implementing unsafe trait requires unsafe impl
ru: Реализация unsafe trait требует unsafe impl

source: Implicit dereferencing from &Vec<T> to &[T]
ru: Неявное разыменование из &ampVec<T> к &amp;[T]

source: Implicit drop occurs
ru: Неявное падение происходит

source: Imports all of std
ru: Импортирует все std

source: Imports all public items
ru: Импортирует все публичные предметы

source: Imports all public items from collections
ru: Импортирует все публичные элементы из коллекций

source: Imports C code
ru: Импортирует код на языке C

source: Imports everything from io
ru: Импортирует все из io

source: Imports hosting for tests only
ru: Импорт хостинга for только тесты

source: Imports io and Write
ru: Импортирует io и Write

source: Imports only HashMap
ru: Только импорт HashMap

source: Imports only locally
ru: Импорт только местного производства

source: Imports only pub use
ru: Только импорт pub use

source: Imports only Write
ru: Только импорт Пишите

source: Imports private items
ru: Импортирует частные предметы

source: Imports private items too
ru: Импортирует и частные предметы

source: Imports the entire collections module
ru: Импортирует весь модуль коллекций

source: Impossible in Rust
ru: Невозможно in Ржавчина

source: Impossible to compile
ru: Невозможно скомпилировать

source: Improves code coverage
ru: Улучшает покрытие кода

source: Improves error messages
ru: Улучшение сообщений об ошибках

source: Improves mutation performance
ru: Повышает эффективность мутации

source: Improves runtime performance only
ru: Улучшает производительность только во время выполнения

source: In a workspace
ru: В рабочем пространстве

source: In all production code
ru: Во всем производственном коде

source: In any function
ru: В любой функции

source: In bin
ru: В мусорном ведре

source: In bin/
ru: В корзину/

source: In Cargo.lock
ru: В Cargo.lock

source: In Cargo.toml
ru: В файле Cargo.toml

source: In Cargo.toml [bin]
ru: В файле Cargo.toml [bin]

source: In Cargo.toml: panic = 'abort' in the target profile
ru: В Cargo.toml: panic = 'abort' in целевой профиль

source: In comments
ru: В комментариях

source: In enums
ru: В перечислениях

source: In examples/prototypes/tests; on invariant violations; in unsafe states
ru: В примерах/прототипах/тестах; о нарушениях инвариантов; in unsafe состояний

source: In functions whose return type is compatible (Result, Option, …)
ru: В функциях, чьи return type совместимы (Result, Option, ...)

source: In if let
ru: На сайте if let

source: In impl only
ru: Только на сайте impl

source: In impl you can override a method with any implementation
ru: В impl вы можете override метод с любой реализацией

source: In let, for, and function parameters
ru: В let, for, и параметры функции

source: In let…else, the else must terminate the function. Convenient for "happy path" code
ru: В let...else, else должен завершать функцию. Удобный код for "счастливого пути"

source: In lib.rs
ru: В файле lib.rs

source: In main.rs
ru: В main.rs

source: In match expressions
ru: В выражениях match

source: In match, if let, while let, for, let, and function parameters
ru: В match, if let , while let , for, let, и параметры функции

source: In order of declaration
ru: В порядке убывания

source: In parallel
ru: Параллельно
